Revit 2026 API

# BuiltInFailuresSubRegionFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresSubRegionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SubRegionFailures
```
```vb
Public NotInheritable Class SubRegionFailures
```
```cpp
public ref class SubRegionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SubRegionFailures = class end
```

The BuiltInFailuresSubRegionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateSubRegionFailed | Create sub-division failed. |
|  | NoHostForToposolidSubregion | This sub-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option. |
|  | SubDivisionOffsetInvalid | Sub-division's offset must be less than the thickness of its type. |
|  | SubDivisionPhaseMismatch | Sub-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub-division phase will be set to match the Toposolid. |

#### Reference

Autodesk.Revit.DB Namespace